package codingTest;

import lombok.extern.slf4j.Slf4j;
import net.sf.json.JSONObject;

@Slf4j
public class JsonToText {
	
	public static void main(String args[]) {
		
//		try {
//			File f = new File("C:\\Users\\seochan\\Downloads\\다국어메시지_0315\\ko.json");
//			FileInputStream fStream = new FileInputStream(f);
//			BufferedInputStream bfStream = new BufferedInputStream(fStream);
//			byte[] buffer = new byte[1024];
//		    int bytesRead = 0;
//		    while ((bytesRead = bfStream.read(buffer)) != -1) {
//		      System.out.println(new String(buffer, "UTF-8"));
//		    }
//		} catch (FileNotFoundException e) {
//			e.printStackTrace();
//		} catch (IOException e) {
//			e.printStackTrace();
//		}
		
		
		String jsonString = "{\r\n" + 
				"    \"NATION\": {\r\n" + 
				"        \"KR\": \"한국\",\r\n" + 
				"        \"TW\": \"대만\"\r\n" + 
				"    },\r\n" + 
				"    \"VIEW\": {\r\n" + 
				"        \"email\": \"이메일\",\r\n" + 
				"		\"gohome\": \"홈으로\",\r\n" + 
				"        \"cancel\": \"취소\",\r\n" + 
				"        \"confirm\": \"확인\"\r\n" + 
				"    },\r\n" + 
				"    \"COMMON\": {\r\n" + 
				"        \"c0010\": \"팝업 닫기\",\r\n" + 
				"        \"c0020\": \"화면(팝업)닫기\",\r\n" + 
				"        \"c0030\": \"확인\"\r\n" + 
				"    },\r\n" + 
				"    \"ERROR\": {\r\n" + 
				"        \"gln-0010\": \"페이지를 표시할 수 없습니다.\",\r\n" + 
				"        \"gln-0011\": \"요청하신 페이지의 주소가 변경, 삭제되어\",\r\n" + 
				"        \"gln-0012\": \"찾을 수 없습니다.\",\r\n" + 
				"        \"NaNumber\": \"숫자만 입력해 주세요.\",\r\n" + 
				"        \"NaEmail\": \"이메일 형식으로 입력해 주세요.\",\r\n" + 
				"        \"NaPhoneNo\": \"휴대폰 번호를 확인하세요.\",\r\n" + 
				"        \"pathAuthFail\": \"올바른 가입 경로가 아닙니다.\",\r\n" + 
				"        \"resetPass4Transaction\": \"비밀번호를 재설정 해주세요.\",\r\n" + 
				"		\"notSupportService\": \"현재 방문하는 국가에서는 사용할 수 없습니다.\",\r\n" + 
				"		\"preparingService\": \"준비중입니다.\",\r\n" + 
				"        \"failSSO\" : {\r\n" + 
				"            \"message\": \"로그인이 실패하였습니다.\",\r\n" + 
				"            \"submsg1\": \"서비스 제공처에 문의하시거나,\",\r\n" + 
				"            \"submsg2\": \"다시 시도하여 주십시오.\"\r\n" + 
				"        },\r\n" + 
				"        \"Unknown\" : {\r\n" + 
				"            \"message\": \"시스템 오류가 발생하였습니다.\",\r\n" + 
				"            \"submsg1\": \"요청하신 페이지를 처리 할 수 없습니다.\",\r\n" + 
				"            \"submsg2\": \"다시 시도하여 주십시오.\"\r\n" + 
				"        }\r\n" + 
				"    },\r\n" + 
				"    \"INT-01-001\": {\r\n" + 
				"        \"gln-0010\": \"어디에 있어도\",\r\n" + 
				"        \"gln-0011\": \"당신은 특별합니다.\",\r\n" + 
				"        \"gln-0020\": \"한국, 인도네시아, 대만, 베트남 등지에서\",\r\n" + 
				"        \"gln-0021\": \"나의 디지털 머니를 사용하고\",\r\n" + 
				"        \"gln-0022\": \"로열티 혜택을 누릴 수 있습니다\",\r\n" + 
				"        \"gln-0030\": \"해외결제 서비스\"\r\n" + 
				"\r\n" + 
				"    },\r\n" + 
				"    \"CNT-02-002\" : {\r\n" + 
				"        \"p0001\": \"매장결제 이용안내\",\r\n" + 
				"        \"p0010\": \"해외에서도 GLN을 통해\",\r\n" + 
				"        \"p0011\": \"쉽게 결제할 수 있어요\",\r\n" + 
				"        \"p0020\": \"결제 가능 매장\",\r\n" + 
				"        \"p0030\": \"GLN 메인 화면에서 “결제” 버튼을 터치하세요\",\r\n" + 
				"        \"p0031\": \"비밀번호를 입력해 바코드(QR)를 생성하세요\",\r\n" + 
				"        \"p0032\": \"점원에게 바코드(QR)를 보여주세요\",\r\n" + 
				"        \"p0033\": \"점원이 바코드(QR)를 스캔하면 결제가 완료됩니다.\"\r\n" + 
				"    },\r\n" + 
				"\r\n" + 
				"    \"CNT-02-003\" : {\r\n" + 
				"        \"p0001\": \"ATM 출금 이용안내\",\r\n" + 
				"        \"p0010\": \"한국에서는 KEB하나은행의 ATM을 이용해 디지털 머니를 출금할 수 있어요\",\r\n" + 
				"        \"p0020\": \"ATM 찾기\",\r\n" + 
				"        \"p0030\": \"GLN 메인 화면에서 “인증번호생성” 버튼을 터치한 후, 비밀번호를 입력하고 “인증번호”를 생성하세요\",\r\n" + 
				"        \"p0040\": \"ATM화면에서 “\",\r\n" + 
				"        \"p0041\": \"GLN 출금\",\r\n" + 
				"        \"p0042\": \"” 버튼을 터치하세요\",\r\n" + 
				"        \"p0050\": \"GLN 화면에서 생성한 “인증번호”를 입력하세요\",\r\n" + 
				"        \"p0060\": \"현금이 출금되면 가져가세요\"\r\n" + 
				"    },\r\n" + 
				"    \"CHG-01-001\": {\r\n" + 
				"        \"gln-title\": \"충전수단선택\",\r\n" + 
				"        \"gln-0010\": \"충전하기\",\r\n" + 
				"        \"gln-0011\": \"해제하기\",\r\n" + 
				"        \"gln-0020\": \"등록하기\"\r\n" + 
				"    },\r\n" + 
				"    \"CHG-01-002\": {\r\n" + 
				"        \"title\": \"추가 정보 등록\",\r\n" + 
				"        \"p0010\": \"충전 계좌 연결\",\r\n" + 
				"        \"p0020\": \"계좌번호 입력\",\r\n" + 
				"        \"p0021\": \"계좌번호\",\r\n" + 
				"        \"p0030\": \"계좌 확인\",\r\n" + 
				"        \"p0040\": \"사용할 수 있는 계좌로 확인 되었습니다.\",\r\n" + 
				"        \"p0050\": \"나중에 등록하기\",\r\n" + 
				"        \"c0010\": \"확인\",\r\n" + 
				"        \"e0010\": \"바로 충전하시겠습니까?\"\r\n" + 
				"    },\r\n" + 
				"\r\n" + 
				"    \"CHG-02-001\": {\r\n" + 
				"        \"gln-title\": \"충전\",\r\n" + 
				"        \"gln-0010\": \"최소\",\r\n" + 
				"        \"gln-0011\": \"이상 입력해 주세요.\",\r\n" + 
				"        \"gln-0020\": \"충전가능 금액\",\r\n" + 
				"        \"gln-0030\": \"최소\",\r\n" + 
				"        \"gln-0031\": \"이상 입력해 주세요.\",\r\n" + 
				"        \"gln-0040\": \"충전 가능 금액\",\r\n" + 
				"        \"gln-0050\": \"금액 입력\"\r\n" + 
				"    },\r\n" + 
				"    \"CHG-03-001\": {\r\n" + 
				"        \"gln-0000\": \"충전\",\r\n" + 
				"        \"gln-0010\": \"기준시각\",\r\n" + 
				"        \"gln-0020\": \"거래시각\",\r\n" + 
				"        \"gln-0030\": \"충전금액\",\r\n" + 
				"        \"gln-0040\": \"수수료\",\r\n" + 
				"        \"gln-0050\": \"충전 후 잔액\",\r\n" + 
				"        \"gln-h001\": \"충전완료\",\r\n" + 
				"        \"gln-h002\": \"화면(팝업)닫기\"\r\n" + 
				"      },\r\n" + 
				"      \"CHG-03-002\": {\r\n" + 
				"          \"gln-0010\": \"충전\",\r\n" + 
				"          \"gln-0020\": \"충전결과\",\r\n" + 
				"          \"gln-0030\": \"충전실패\"\r\n" + 
				"      },\r\n" + 
				"    \"CHG-04-001\": {\r\n" + 
				"        \"gln-0010\": \"충전\",\r\n" + 
				"        \"gln-0020\": \"충전 결과\",\r\n" + 
				"        \"gln-0030\": \"충전 성공\",\r\n" + 
				"        \"gln-0040\": \"충전\",\r\n" + 
				"        \"gln-0050\": \"충전 금액\",\r\n" + 
				"        \"gln-0060\": \"거래 후 잔액\",\r\n" + 
				"        \"gln-0070\": \"수수료\",\r\n" + 
				"        \"gln-0080\": \"거래시각\",\r\n" + 
				"        \"gln-0090\": \"충전 실패\"\r\n" + 
				"    },\r\n" + 
				"\r\n" + 
				"    \"FOT-01-001\" : {\r\n" + 
				"        \"p0020\": \"매장 결제\",\r\n" + 
				"        \"p0030\": \"ATM 출금\"\r\n" + 
				"    },\r\n" + 
				"    \"MAN-01-001\": {\r\n" + 
				"        \"gln-0010\": \"국가를 선택하세요.\",\r\n" + 
				"        \"gln-0020\": \"좋은 날입니다.\",\r\n" + 
				"        \"gln-0021\": \"오늘도 즐거운 여행하세요.\",\r\n" + 
				"        \"gln-0022\": \"현재 계신 국가에서는 결제 서비스가\",\r\n" + 
				"        \"gln-0023\": \"불가능합니다. 국가를 선택해주세요\",\r\n" + 
				"        \"gln-0030\": \"은\",\r\n" + 
				"        \"gln-0031\": \"보다\",\r\n" + 
				"        \"gln-0032\": \"시간\",\r\n" + 
				"        \"gln-0033\": \"느립니다.\",\r\n" + 
				"        \"gln-0034\": \"빠릅니다.\",\r\n" + 
				"        \"gln-0040\": \"충전\",\r\n" + 
				"        \"gln-0050\": \"우리돈으로 얼마일까?\",\r\n" + 
				"        \"gln-0060\": \"적용환율\"\r\n" + 
				"\r\n" + 
				"    },\r\n" + 
				"    \"MBR-01-001\": {\r\n" + 
				"        \"gln-title\": \"이용약관 동의\",\r\n" + 
				"        \"gln-0010\": \"전체 확인 및 동의하기\"\r\n" + 
				"    },\r\n" + 
				"    \"MBR-03-001\": {\r\n" + 
				"        \"gln-title\": \"서비스가입\",\r\n" + 
				"        \"gln-0010\": \"축하드립니다.\",\r\n" + 
				"        \"gln-0011\": \"GLN 서비스가입이 완료되었습니다.\",\r\n" + 
				"        \"gln-0020\": \"메인으로\"\r\n" + 
				"    },\r\n" + 
				"\r\n" + 
				"    \"MBR-03-002\": {\r\n" + 
				"        \"title\": \"회원가입\",\r\n" + 
				"        \"p0010\": \"휴대폰 번호 등록\",\r\n" + 
				"        \"p0020\": \"이메일 등록\",\r\n" + 
				"        \"p0030\": \"아래 이메일로 인증번호가 전송되었습니다.\",\r\n" + 
				"        \"p0040\": \"이메일 인증번호 재발송\",\r\n" + 
				"        \"p0050\": \"이메일 내용의 '6자리 인증번호'를 입력하세요.\",\r\n" + 
				"        \"p0051\": \"이메일 인증번호 입력\",\r\n" + 
				"        \"p0052\": \"이메일 인증번호\",\r\n" + 
				"        \"c0010\": \"확인\"\r\n" + 
				"    },\r\n" + 
				"\r\n" + 
				"    \"MBR-04-001\": {\r\n" + 
				"        \"title\": \"회원가입\",\r\n" + 
				"        \"p0010\": \"거래승인 비밀번호를 등록하세요.\",\r\n" + 
				"        \"p0012\": \"확인을 위해 한번 더 입력해 주세요.\",\r\n" + 
				"        \"p0020\": \"비밀번호 첫번째 입력 완료\",\r\n" + 
				"        \"p0030\": \"비밀번호 두번째 입력 완료\",\r\n" + 
				"        \"p0040\": \"비밀번호 세번째 입력 완료\",\r\n" + 
				"        \"p0050\": \"비밀번호 네번째 입력 완료\",\r\n" + 
				"        \"p0060\": \"비밀번호 다섯번째 입력 완료\",\r\n" + 
				"        \"p0070\": \"비밀번호 여섯번째 입력 완료\",\r\n" + 
				"        \"e0010\": \"이전 비밀번호와 일치하지 않습니다.\",\r\n" + 
				"        \"c0010\": \"삭제\"\r\n" + 
				"    },\r\n" + 
				"\r\n" + 
				"    \"MBR-05-001\": {\r\n" + 
				"        \"title\": \"회원가입\",\r\n" + 
				"        \"p0010\": \"축하합니다.\",\r\n" + 
				"        \"p0020\": \"GLN 서비스 회원가입이 완료되었습니다.\",\r\n" + 
				"        \"p0030\": \"충전 계좌를 등록하시고 GLN과 함께\",\r\n" + 
				"        \"p0040\": \"더 스마트한 여행을 떠나보세요.\",\r\n" + 
				"        \"p0050\": \"지금 등록하기\",\r\n" + 
				"        \"p0060\": \"나중에 등록하기\"\r\n" + 
				"    },\r\n" + 
				"    \"OFF-01-001\": {\r\n" + 
				"        \"gln-0010\": \"현재 하나멤버스의 '해외결제'는\",\r\n" + 
				"        \"gln-0011\": \"대만에서만 사용이 가능합니다.\",\r\n" + 
				"        \"gln-0020\": \"현재 위치한 국가로 설정\"\r\n" + 
				"    },\r\n" + 
				"    \"OFF-01-002\": {\r\n" + 
				"        \"title\": \"\",\r\n" + 
				"        \"c0010\": \"확인\"\r\n" + 
				"    },\r\n" + 
				"    \"OFF-02-001\": {\r\n" + 
				"        \"gln-title\": \"매장결제\",\r\n" + 
				"        \"gln-0010\": \"거래 시 수수료가 부과됩니다.\",\r\n" + 
				"        \"gln-0020\": \"이용 안내\",\r\n" + 
				"        \"gln-0030\": \"충전\"\r\n" + 
				"    },\r\n" + 
				"\r\n" + 
				"    \"OFF-03-001\": {\r\n" + 
				"        \"gln-title\": \"이용안내\",\r\n" + 
				"        \"gln-0010\": \"이용안내 내용은 GLN 현업에서 개발팀에게 전달 예정\"\r\n" + 
				"    },\r\n" + 
				"    \"OFF-04-001\": {\r\n" + 
				"        \"gln-0010\": \"다시생성\",\r\n" + 
				"        \"gln-0020\": \"거래 수수료가 부과됩니다.\"\r\n" + 
				"    },\r\n" + 
				"    \"OFF-04-002\": {\r\n" + 
				"        \"p0010\": \"매장결제\",\r\n" + 
				"        \"p0020\": \"금액\",\r\n" + 
				"        \"p0030\": \"거래 시 수수료가 부가됩니다.\",\r\n" + 
				"        \"p0040\": \"바코드\",\r\n" + 
				"        \"p0050\": \"QR코드\",\r\n" + 
				"        \"p0060\": \"확대보기\",\r\n" + 
				"        \"p0070\": \"매장목록\",\r\n" + 
				"        \"p0080\": \"다시생성\",\r\n" + 
				"        \"c0010\": \"화면(팝업)닫기\"\r\n" + 
				"    },\r\n" + 
				"    \"OFF-05-001\": {\r\n" + 
				"        \"gln-0010\": \"결제 완료\",\r\n" + 
				"        \"gln-0020\": \"적용환율\"\r\n" + 
				"    },\r\n" + 
				"    \"OFF-05-002\": {\r\n" + 
				"        \"gln-0010\": \"결제\",\r\n" + 
				"        \"gln-0011\": \"결제결과\",\r\n" + 
				"        \"gln-0020\": \"결제실패\"\r\n" + 
				"    },\r\n" + 
				"    \"OFF-06-001\": {\r\n" + 
				"        \"gln-title\": \"매장결제\",\r\n" + 
				"        \"gln-0010\": \"사용 안내\",\r\n" + 
				"        \"gln-0020\": \"충전\"\r\n" + 
				"    },\r\n" + 
				"    \"OFF-06-002\": {\r\n" + 
				"        \"gln-title\": \"매장결제\",\r\n" + 
				"        \"gln-0010\": \"금액 입력\",\r\n" + 
				"        \"gln-0020\": \"결제가능 금액\",\r\n" + 
				"        \"gln-0030\": \"거래 수수료가 부과됩니다.\",\r\n" + 
				"        \"gln-0040\": \"확인\"\r\n" + 
				"    },\r\n" + 
				"    \"OFF-06-003\": {\r\n" + 
				"        \"gln-0010\": \"결제할 금액이 맞나요?\",\r\n" + 
				"        \"gln-0020\": \"사용금액\",\r\n" + 
				"        \"gln-0030\": \"결제금액\",\r\n" + 
				"        \"gln-0040\": \"수수료\"\r\n" + 
				"    },\r\n" + 
				"    \"OFF-06-004\": {\r\n" + 
				"        \"gln-0010\": \"거래내역\",\r\n" + 
				"        \"gln-0020\": \"상세내역\",\r\n" + 
				"        \"gln-0030\": \"결제완료\",\r\n" + 
				"        \"gln-0040\": \"결제금액\",\r\n" + 
				"        \"gln-0050\": \"수수료\",\r\n" + 
				"        \"gln-0060\": \"거래 후 잔액\",\r\n" + 
				"        \"gln-0070\": \"매장직원이 확인요청을 하면\",\r\n" + 
				"        \"gln-0071\": \"아래 내용을 보여주세요.\"\r\n" + 
				"    },\r\n" + 
				"    \"OFF-08-001\": {\r\n" + 
				"        \"p0010\": \"매장결제\",\r\n" + 
				"        \"p0020\": \"금액 입력\",\r\n" + 
				"		\"p0021\": \"금액 입력\",\r\n" + 
				"		\"p0022\": \"입력삭제\",\r\n" + 
				"		\"p0030\": \"결제 가능 금액\",\r\n" + 
				"		\"p0040\": \"거래 수수료가 부과됩니다.\",\r\n" + 
				"		\"p0050\": \"확인\"\r\n" + 
				"	},\r\n" + 
				"    \"OFF-08-002\": {\r\n" + 
				"        \"p0010\": \"결제할 금액이 맞나요?\",\r\n" + 
				"        \"p0020\": \"사용 금액\",\r\n" + 
				"		\"p0030\": \"결제 금액\",\r\n" + 
				"		\"p0040\": \"수수료\",\r\n" + 
				"		\"p0050\": \"취소\",\r\n" + 
				"		\"p0060\": \"확인\"\r\n" + 
				"	},\r\n" + 
				"    \"OFF-09-001\": {\r\n" + 
				"        \"p0010\": \"결제 완료\",\r\n" + 
				"        \"p0020\": \"적용환율\"\r\n" + 
				"	},\r\n" + 
				"    \"USE-01-001\": {\r\n" + 
				"        \"gln-title\": \"사용내역\",\r\n" + 
				"        \"gln-0010\": \"충전하기\",\r\n" + 
				"        \"gln-0020\": \"조회옵션\",\r\n" + 
				"        \"gln-0030\": \"사용 내역이 없습니다.\",\r\n" + 
				"\r\n" + 
				"        \"koex001-title\": \"사용내역\"\r\n" + 
				"    },\r\n" + 
				"\r\n" + 
				"    \"USE-02-001\": {\r\n" + 
				"        \"gln-title\": \"조회옵션\",\r\n" + 
				"        \"gln-0010\": \"조회기간\",\r\n" + 
				"        \"gln-0020\": \"거래이력\",\r\n" + 
				"        \"gln-0030\": \"잔액변동\",\r\n" + 
				"        \"gln-0040\": \"정렬순서\",\r\n" + 
				"\r\n" + 
				"        \"koex001-title\": \"보기옵션\",\r\n" + 
				"        \"koex001-0010\": \"조회기간\",\r\n" + 
				"        \"koex001-0020\": \"거래이력\",\r\n" + 
				"        \"koex001-0030\": \"잔액변동\",\r\n" + 
				"        \"koex001-0040\": \"정렬순서\",\r\n" + 
				"        \"koex001-confirm\": \"확인\"\r\n" + 
				"    },\r\n" + 
				"    \"USE-03-001\": {\r\n" + 
				"        \"gln-0010\": \"거래내역\",\r\n" + 
				"        \"gln-0020\": \"상세내역\",\r\n" + 
				"        \"gln-0030\": \"거래시각\",\r\n" + 
				"        \"gln-0040\": \"현지시각\",\r\n" + 
				"        \"gln-0050\": \"취소금액\",\r\n" + 
				"        \"gln-0051\": \"환불금액\",\r\n" + 
				"        \"gln-0052\": \"사용금액\",\r\n" + 
				"        \"gln-0053\": \"충전금액\",\r\n" + 
				"        \"gln-0054\": \"환급금액\",\r\n" + 
				"        \"gln-0060\": \"취소금액\",\r\n" + 
				"        \"gln-0061\": \"환불금액\",\r\n" + 
				"        \"gln-0062\": \"결제금액\",\r\n" + 
				"        \"gln-0063\": \"충전금액\",\r\n" + 
				"        \"gln-0064\": \"환급금액\",\r\n" + 
				"        \"gln-0070\": \"수수료\",\r\n" + 
				"        \"gln-0080\": \"거래 후 잔액\",\r\n" + 
				"\r\n" + 
				"        \"koex001-title\": \"결제\",\r\n" + 
				"        \"koex001-0010\": \"거래시간\",\r\n" + 
				"        \"koex001-0011\": \"현지시간\",\r\n" + 
				"        \"koex001-0020\": \"사용금액\",\r\n" + 
				"        \"koex001-0021\": \"결제금액\",\r\n" + 
				"        \"koex001-0022\": \"수수료\",\r\n" + 
				"        \"koex001-0023\": \"거래 후 잔액\"\r\n" + 
				"    },\r\n" + 
				"    \"USE-03-002\": {\r\n" + 
				"        \"gln-0010\": \"거래내역\",\r\n" + 
				"        \"gln-0020\": \"상세내역\",\r\n" + 
				"        \"gln-0030\": \"환급\",\r\n" + 
				"        \"gln-0040\": \"거래시각\",\r\n" + 
				"        \"gln-0050\": \"환급금액\",\r\n" + 
				"        \"gln-0060\": \"수수료\",\r\n" + 
				"        \"gln-0070\": \"거래 후 잔액\",\r\n" + 
				"\r\n" + 
				"        \"koex001-title\": \"전환\",\r\n" + 
				"        \"koex001-subtitle\": \"충전\",\r\n" + 
				"        \"koex001-0010\": \"거래시간\",\r\n" + 
				"        \"koex001-0011\": \"현지시간\",\r\n" + 
				"        \"koex001-0020\": \"충전금액\",\r\n" + 
				"        \"koex001-0021\": \"결제금액\",\r\n" + 
				"        \"koex001-0022\": \"수수료\",\r\n" + 
				"        \"koex001-0023\": \"거래 후 잔액\"\r\n" + 
				"    },\r\n" + 
				"    \"USE-03-003\": {\r\n" + 
				"        \"koex001-title\": \"전환\",\r\n" + 
				"        \"koex001-subtitle\": \"환급\",\r\n" + 
				"        \"koex001-0010\": \"거래시간\",\r\n" + 
				"        \"koex001-0011\": \"현지시간\",\r\n" + 
				"        \"koex001-0020\": \"환급금액\",\r\n" + 
				"        \"koex001-0021\": \"결제금액\",\r\n" + 
				"        \"koex001-0022\": \"수수료\",\r\n" + 
				"        \"koex001-0023\": \"거래 후 잔액\"\r\n" + 
				"    },\r\n" + 
				"    \"USE-03-004\": {\r\n" + 
				"\r\n" + 
				"        \"koex001-title\": \"결제취소\",\r\n" + 
				"        \"koex001-0010\": \"거래시간\",\r\n" + 
				"        \"koex001-0011\": \"현지시간\",\r\n" + 
				"        \"koex001-0020\": \"취소금액\",\r\n" + 
				"        \"koex001-0021\": \"취소 후 잔액\"\r\n" + 
				"    },\r\n" + 
				"    \"USE-03-005\": {\r\n" + 
				"        \"koex001-title\": \"결제환불\",\r\n" + 
				"        \"koex001-0010\": \"거래시간\",\r\n" + 
				"        \"koex001-0011\": \"현지시간\",\r\n" + 
				"        \"koex001-0020\": \"환불금액\",\r\n" + 
				"        \"koex001-0021\": \"사용금액\",\r\n" + 
				"        \"koex001-0022\": \"환불 수수료\",\r\n" + 
				"        \"koex001-0023\": \"환불 후 잔액\"\r\n" + 
				"    },\r\n" + 
				"    \"CONDITION\": {\r\n" + 
				"        \"P_DT_S_TYPE\": {\r\n" + 
				"            \"10\": \"1일\",\r\n" + 
				"            \"20\": \"1주\",\r\n" + 
				"            \"30\": \"2주\",\r\n" + 
				"            \"40\": \"1개월\",\r\n" + 
				"            \"50\": \"3개월\",\r\n" + 
				"            \"60\": \"6개월\",\r\n" + 
				"            \"70\": \"1년\",\r\n" + 
				"            \"80\": \"직접입력\"\r\n" + 
				"        },\r\n" + 
				"        \"P_MBR_SVC_DV_CD\": {\r\n" + 
				"            \"00\": \"거래전체\",\r\n" + 
				"            \"01\": \"송금\",\r\n" + 
				"            \"02\": \"매장결제\",\r\n" + 
				"            \"03\": \"ATM 출금\",\r\n" + 
				"            \"04\": \"충전\",\r\n" + 
				"            \"05\": \"환급\"\r\n" + 
				"        },\r\n" + 
				"        \"P_DT_V_TYPE\": {\r\n" + 
				"            \"00\": \"전체\",\r\n" + 
				"            \"10\": \"증가\",\r\n" + 
				"            \"20\": \"차감\"\r\n" + 
				"        },\r\n" + 
				"        \"P_DT_O_TYPE\": {\r\n" + 
				"            \"10\": \"최신순\",\r\n" + 
				"            \"20\": \"과거순\"\r\n" + 
				"        }\r\n" + 
				"    },\r\n" + 
				"    \"LOG-01-001\" : {\r\n" + 
				"        \"gln-0010\": \"GLN 아이디\",\r\n" + 
				"        \"gln-0020\": \"비밀번호\",\r\n" + 
				"        \"gln-0030\": \"로그인\"\r\n" + 
				"    },\r\n" + 
				"    \"LOG-02-001\": {\r\n" + 
				"        \"gln-title\": \"GLN ID 찾기\",\r\n" + 
				"        \"gln-0010\": \"아이디 찾기가 완료되었습니다.\",\r\n" + 
				"        \"gln-0020\": \"로그인하기\"\r\n" + 
				"    },\r\n" + 
				"    \"LOG-03-001\" : {\r\n" + 
				"        \"gln-title\": \"GLN 비밀번호 찾기\",\r\n" + 
				"        \"gln-0010\": \"회원인증\",\r\n" + 
				"        \"gln-0020\": \"GLN 아이디\",\r\n" + 
				"        \"gln-0030\": \"아이디 입력\",\r\n" + 
				"        \"gln-0040\": \"아이디를 확인해 주세요.\",\r\n" + 
				"        \"gln-0050\": \"아이디 확인\",\r\n" + 
				"        \"gln-0060\": \"회원인증\",\r\n" + 
				"        \"gln-0070\": \"휴대폰번호(SMS) 확인\",\r\n" + 
				"        \"gln-0071\": \"이메일 확인\",\r\n" + 
				"        \"gln-0072\": \"거래승인 비밀번호 확인\",\r\n" + 
				"        \"gln-0073\": \"본인확인 질문 답변\",\r\n" + 
				"        \"gln-0080\": \"회원인증을 위해 정보확인이 필요합니다.\"\r\n" + 
				"    },\r\n" + 
				"    \"LOG-04-001\": {\r\n" + 
				"        \"gln-title\": \"비밀번호 찾기\",\r\n" + 
				"        \"gln-0010\": \"비밀번호 재설정이 완료되었습니다.\",\r\n" + 
				"        \"gln-0020\": \"로그인 하기\"\r\n" + 
				"    },\r\n" + 
				"    \"LOG-05-001\": {\r\n" + 
				"        \"title\": \"휴대폰 번호 인증\",\r\n" + 
				"        \"p0010\": \"휴대폰 번호(SMS) 확인\",\r\n" + 
				"        \"p0011\": \"휴대폰 번호('-'없이 입력)\",\r\n" + 
				"        \"p0020\": \"인증번호 받기\",\r\n" + 
				"        \"p0021\": \"인증번호 입력\",\r\n" + 
				"        \"p0022\": \"인증번호\",\r\n" + 
				"        \"p0030\": \"인증번호 재발송\",\r\n" + 
				"        \"c0010\": \"인증번호 받기\"\r\n" + 
				"    },\r\n" + 
				"    \"LOG-05-002\": {\r\n" + 
				"        \"title\": \"비밀번호 찾기\"\r\n" + 
				"    },\r\n" + 
				"    \"LOG-05-003\": {\r\n" + 
				"        \"title\": \"비밀번호 찾기\"\r\n" + 
				"    },\r\n" + 
				"    \"LOG-05-005\": {\r\n" + 
				"        \"title\": \"비밀번호 찾기\"\r\n" + 
				"    },\r\n" + 
				"    \"LOG-06-001\": {\r\n" + 
				"        \"title\": \"비밀번호 찾기\",\r\n" + 
				"        \"p0010\": \"비밀번호 재설정이 완료되었습니다.\",\r\n" + 
				"        \"c0010\": \"로그인하기\"\r\n" + 
				"    },\r\n" + 
				"    \"MPG-01-001\" : {\r\n" + 
				"        \"gln-title\": \"회원정보관리\",\r\n" + 
				"        \"gln-0010\": \"기본 회원 정보 변경\",\r\n" + 
				"        \"gln-0020\": \"로그인 비밀번호 변경\",\r\n" + 
				"        \"gln-0030\": \"휴대폰 번호 정보\",\r\n" + 
				"        \"gln-0031\": \"휴대폰 번호 등록\",\r\n" + 
				"        \"gln-0040\": \"이메일 정보\",\r\n" + 
				"        \"gln-0041\": \"이메일 등록\",\r\n" + 
				"        \"gln-0050\": \"본인확인 질문답변 등록\",\r\n" + 
				"        \"gln-0060\": \"로그아웃\",\r\n" + 
				"        \"gln-0070\": \"회원탈퇴\",\r\n" + 
				"        \"gln-0080\": \"정말 로그아웃하시겠습니까?\"\r\n" + 
				"    },\r\n" + 
				"    \"MPG-02-001\" : {\r\n" + 
				"        \"gln-title\":\"기본 회원정보 변경\",\r\n" + 
				"        \"gln-0010\":\"이름\",\r\n" + 
				"        \"gln-0020\":\"생년월일\"\r\n" + 
				"    },\r\n" + 
				"    \"MPG-02-002\" : {\r\n" + 
				"        \"gln-title\": \"기본 회원정보 변경\",\r\n" + 
				"        \"gln-0010\": \"기본 정보 변경이 완료되었습니다.\",\r\n" + 
				"        \"gln-0020\": \"회원정보관리\"\r\n" + 
				"    },\r\n" + 
				"    \"MPG-03-001\" :{\r\n" + 
				"        \"gln-title\": \"로그인 비밀번호 변경\",\r\n" + 
				"        \"gln-0010\": \"현재 비밀번호\",\r\n" + 
				"        \"gln-0020\": \"비밀번호를 잊으셨나요?\"\r\n" + 
				"    },\r\n" + 
				"    \"MPG-03-002\" : {\r\n" + 
				"        \"gln-title\": \"로그인 비밀번호 변경\",\r\n" + 
				"        \"gln-0010\": \"비밀번호 재설정\",\r\n" + 
				"        \"gln-0011\": \"비밀번호 확인\",\r\n" + 
				"        \"gln-0020\": \"8자 이상 입력 해주세요\",\r\n" + 
				"        \"gln-0021\": \"영문소문자를 입력 해주세요.(숫자 또는 기호 포함)\",\r\n" + 
				"        \"gln-0022\": \"확인을 위해 2번 입력 해주세요.\"\r\n" + 
				"    },\r\n" + 
				"    \"MPG-03-003\" : {\r\n" + 
				"        \"gln-title\": \"로그인 비밀번호 변경\",\r\n" + 
				"        \"gln-0010\": \"로그인 비밀번호 재설정이 완료되었습니다.\",\r\n" + 
				"        \"gln-0020\": \"회원정보관리\"\r\n" + 
				"    },\r\n" + 
				"    \"MPG-04-001\": {\r\n" + 
				"        \"gln-title\": \"휴대폰 번호 등록\",\r\n" + 
				"        \"gln-0010\": \"휴대폰번호('-'없이 입력)\",\r\n" + 
				"        \"gln-0020\": \"휴대번호를 확인해 주세요.\",\r\n" + 
				"        \"gln-0030\": \"인증번호 받기\",\r\n" + 
				"        \"gln-0040\": \"인증번호\",\r\n" + 
				"        \"gln-0050\": \"인증번호 재발송\"\r\n" + 
				"\r\n" + 
				"    },\r\n" + 
				"    \"MPG-04-002\": {\r\n" + 
				"        \"gln-title\": \"휴대폰 번호 관리\",\r\n" + 
				"        \"gln-0010\": \"추가\"\r\n" + 
				"    },\r\n" + 
				"    \"MPG-04-003\": {\r\n" + 
				"        \"title\": \"거래승인 비밀번호 재설정\",\r\n" + 
				"        \"p0010\": \"확인을 위해 한번 더 입력해 주세요\",\r\n" + 
				"        \"e0010\": \"이전 비밀번호와 일치하지 않습니다.\"\r\n" + 
				"    },\r\n" + 
				"    \"MPG-04-004\": {\r\n" + 
				"        \"title\": \"거래승인 비밀번호 재설정\",\r\n" + 
				"        \"p0010\": \"거래승인 비밀번호 재설정이\",\r\n" + 
				"        \"p0011\": \"완료되었습니다.\",\r\n" + 
				"        \"c0010\": \"MY PAGE\"\r\n" + 
				"    },\r\n" + 
				"    \"MPG-05-001\": {\r\n" + 
				"        \"gln-title\": \"이메일 등록\",\r\n" + 
				"        \"gln-0010\": \"이메일 등록\",\r\n" + 
				"        \"gln-0011\": \"이메일 확인\",\r\n" + 
				"        \"gln-0020\": \"인증번호를 받을 수 있는 이메일을 입력해 주세요.\",\r\n" + 
				"        \"gln-0021\": \"확인을 위해 2번 입력해 주세요.\"\r\n" + 
				"\r\n" + 
				"    },\r\n" + 
				"    \"MPG-05-002\": {\r\n" + 
				"        \"gln-title\": \"이메일 등록\",\r\n" + 
				"        \"gln-0010\": \"아래 이메일로 인증번호가 전송되었습니다.\",\r\n" + 
				"        \"gln-0020\": \"이메일 인증번호\",\r\n" + 
				"        \"gln-0030\": \"전송받은 '6자리 인증번호'를 입력해주세요.\"\r\n" + 
				"\r\n" + 
				"    },\r\n" + 
				"    \"MPG-05-003\" : {\r\n" + 
				"        \"gln-title\": \"이메일 정보\"\r\n" + 
				"\r\n" + 
				"    },\r\n" + 
				"    \"MPG-05-004\" : {\r\n" + 
				"        \"title\": \"비밀번호 찾기\",\r\n" + 
				"        \"p0010\": \"비밀번호 재설정이 완료되었습니다.\",\r\n" + 
				"        \"c0010\": \"로그인하기\"\r\n" + 
				"\r\n" + 
				"    },\r\n" + 
				"    \"MPG-05-005\": {\r\n" + 
				"        \"title\": \"본인확인 질문답변 등록\",\r\n" + 
				"        \"p0010\": \"본인확인 질문답변 등록\",\r\n" + 
				"        \"p0020\": \"본인확인 질문답변을 등록하여 보안수준을 높여보세요.\",\r\n" + 
				"        \"p0030\": \"질문 선택하기\",\r\n" + 
				"        \"e0010\": \"문자,숫자만 입력해주세요(3~30자리)\",\r\n" + 
				"        \"c0010\": \"두 번째 질문 추가(선택)\",\r\n" + 
				"        \"c0020\": \"세 번째 질문 추가(선택)\"\r\n" + 
				"    },\r\n" + 
				"    \"MPG-05-006\" : {\r\n" + 
				"        \"title\": \"본인확인 질문답변 등록\",\r\n" + 
				"        \"p0010\": \"본인확인 질문답변 등록\"\r\n" + 
				"    },\r\n" + 
				"    \"MPG-06-001\" : {\r\n" + 
				"        \"gln-title\": \"본인확인 질문답변 관리\",\r\n" + 
				"        \"gln-0010\": \"본인 확인 질문에 대한 답변을 수정하기 위하여 현재의 답변을 입력해 주세요.\",\r\n" + 
				"        \"gln-0020\": \"다른 질문 보기\"\r\n" + 
				"    },\r\n" + 
				"    \"MPG-06-002\" : {\r\n" + 
				"        \"title\": \"본인확인 질문답변 등록\",\r\n" + 
				"        \"p0010\": \"본인확인 질문답변 등록\"\r\n" + 
				"    },\r\n" + 
				"    \"MPG-06-003\" : {\r\n" + 
				"        \"title\": \"본인확인 질문답변 변경\",\r\n" + 
				"        \"p0010\": \"본인 확인 질문에 대한 답변을 수정하기 위하여 현재의 답변을 입력해 주세요\",\r\n" + 
				"        \"c0010\": \"다른 질문 보기\"\r\n" + 
				"    },\r\n" + 
				"    \"MPG-06-004\" : {\r\n" + 
				"        \"title\": \"본인확인 질문답변 변경\",\r\n" + 
				"        \"p0010\": \"첫 번째 질문 답변\",\r\n" + 
				"        \"p0011\": \"두 번째 질문 답변\",\r\n" + 
				"        \"p0012\": \"세 번째 질문 답변\",\r\n" + 
				"        \"p0020\": \"질문 선택하기\",\r\n" + 
				"        \"c0010\": \"두 번째 질문 추가(선택)\",\r\n" + 
				"        \"c0020\": \"세 번째 질문 추가(선택)\",\r\n" + 
				"        \"e0010\": \"문자,숫자만 입력해주세요(3~30자리)\",\r\n" + 
				"        \"e0020\": \"최소 1개 이상의 질문답변 정보가 필요합니다.\",\r\n" + 
				"        \"e0030\": \"등록된 질문답변을 삭제하시겠습니까?\"\r\n" + 
				"    },\r\n" + 
				"    \"MPG-06-005\" : {\r\n" + 
				"        \"title\": \"로그인ID/비밀번호 등록\",\r\n" + 
				"        \"p0010\": \"\",\r\n" + 
				"        \"p0020\": \"\"\r\n" + 
				"    },\r\n" + 
				"    \"MPG-07-001\" : {\r\n" + 
				"        \"title\": \"휴대폰 번호 인증\",\r\n" + 
				"\r\n" + 
				"        \"p0010\": \"휴대폰 번호(SMS) 확인\",\r\n" + 
				"        \"p0011\": \"휴대폰 번호('-'없이 입력)\",\r\n" + 
				"        \"p0020\": \"인증번호 받기\",\r\n" + 
				"        \"p0021\": \"인증번호 입력\",\r\n" + 
				"        \"p0022\": \"인증번호\",\r\n" + 
				"        \"p0030\": \"인증번호 재발송\",\r\n" + 
				"        \"c0010\": \"인증번호 받기\"\r\n" + 
				"    },\r\n" + 
				"    \"MPG-07-002\": {\r\n" + 
				"        \"title\": \"이메일 인증\"\r\n" + 
				"    },\r\n" + 
				"    \"MPG-07-005\": {\r\n" + 
				"        \"title\": \"본인확인 질문답변 인증\",\r\n" + 
				"        \"p0010\": \"본인 확인 질문에 대한 답변을 수정하기 위하여 현재의 답변을 입력해 주세요\",\r\n" + 
				"        \"c0010\": \"다른 질문 보기\"\r\n" + 
				"    },\r\n" + 
				"    \"MPG-07-006\": {\r\n" + 
				"        \"title\": \"로그인 비밀번호 인증\",\r\n" + 
				"        \"p0010\": \"비밀번호 확인\",\r\n" + 
				"        \"p0020\": \"현재 비밀번호\"\r\n" + 
				"    },\r\n" + 
				"    \"MPG-08-001\":{\r\n" + 
				"        \"gln-title\":\"회원 탈퇴\",\r\n" + 
				"        \"gln-0010\":\"회원 탈퇴 후에는 하나멤버스를 통해서만 서비스를 받으실 수 있습니다.\",\r\n" + 
				"        \"gln-0020\":\"외부 브라우저를 통해 바로 서비스 받을 수 있도록 GLN 회원을 유지해주세요.\",\r\n" + 
				"        \"gln-0030\":\"탈퇴하기\"\r\n" + 
				"    },\r\n" + 
				"    \"SET-01-001\": {\r\n" + 
				"        \"gln-title\": \"환경설정\",\r\n" + 
				"        \"gln-0010\": \"언어 설정\",\r\n" + 
				"        \"gln-0020\": \"국가/통화 설정\",\r\n" + 
				"        \"gln-0030\":\"거래승인 비밀번호 변경 안내\",\r\n" + 
				"        \"gln-0031\":\"거래승인 비밀번호 변경\",\r\n" + 
				"        \"gln-0040\":\"충전수단 관리\",\r\n" + 
				"        \"gln-0050\":\"서비스 정보 동의\",\r\n" + 
				"        \"gln-0060\":\"회원가입\",\r\n" + 
				"        \"gln-0061\":\"회원 정보 관리\",\r\n" + 
				"        \"gln-0070\":\"GLN 소개\",\r\n" + 
				"        \"gln-0080\":\"이용안내\",\r\n" + 
				"\r\n" + 
				"        \"koex001-title\": \"환경설정\",\r\n" + 
				"        \"koex001-0010\": \"국가/통화 설정\",\r\n" + 
				"        \"koex001-0020\": \"서비스 정보 동의\",\r\n" + 
				"        \"koex001-0030\": \"GLN 소개\",\r\n" + 
				"        \"koex001-0040\": \"이용안내\"\r\n" + 
				"    },\r\n" + 
				"    \"SET-02-001\": {\r\n" + 
				"      \"gln-title\": \"통화설정\",\r\n" + 
				"      \"koex001-title\": \"통화설정\",\r\n" + 
				"      \"koex001-0010\": \"현지위치 통화\"\r\n" + 
				"    },\r\n" + 
				"\r\n" + 
				"    \"SET-03-001\": {\r\n" + 
				"        \"gln-title\": \"국가/통화설정\",\r\n" + 
				"        \"gln-0010\": \"현지위치 통화\",\r\n" + 
				"\r\n" + 
				"        \"koex001-title\": \"통화설정\",\r\n" + 
				"        \"koex001-0010\": \"현지위치 통화\",\r\n" + 
				"        \"koex001-0020\": \"동의 안함\",\r\n" + 
				"        \"koex001-0030\": \"서비스 탈퇴하기\"\r\n" + 
				"	},\r\n" + 
				"\r\n" + 
				"    \"SET-04-001\": {\r\n" + 
				"        \"gln-title\": \"거래승인 비밀번호 변경\",\r\n" + 
				"        \"gln-0010\": \"거래승인 비밀번호 재설정은\",\r\n" + 
				"        \"gln-0011\": \"하나멤버스 앱에서 가능합니다.\",\r\n" + 
				"        \"gln-0020\": \"하나멤버스로 가기\"\r\n" + 
				"    },\r\n" + 
				"    \"SET-04-002\": {\r\n" + 
				"        \"gln-title\": \"거래승인 비밀번호 변경\",\r\n" + 
				"        \"gln-0010\": \"거래승인 비밀번호를 등록하세요\"\r\n" + 
				"    },\r\n" + 
				"    \"SET-05-001\": {\r\n" + 
				"        \"gln-title\": \"충전수단 관리\",\r\n" + 
				"        \"gln-0010\": \"충전하기\",\r\n" + 
				"        \"gln-0020\": \"해제하기\",\r\n" + 
				"        \"gln-0030\": \"등록하기\",\r\n" + 
				"        \"gln-0040\": \"환급하기\"\r\n" + 
				"\r\n" + 
				"    },\r\n" + 
				"    \"SET-05-002\": {\r\n" + 
				"        \"gln-title\": \"충전수단 등록\",\r\n" + 
				"        \"gln-0010\": \"계좌번호\",\r\n" + 
				"        \"gln-0020\": \"계좌비밀번호\",\r\n" + 
				"        \"gln-0030\": \"계좌번호를 확인해주세요.\"\r\n" + 
				"    },\r\n" + 
				"    \"SET-05-003\": {\r\n" + 
				"        \"gln-title\": \"충전수단 등록\",\r\n" + 
				"        \"gln-0010\": \"잘 하셨습니다!\",\r\n" + 
				"        \"gln-0020\": \"충전수단 등록이 완료되었습니다.\",\r\n" + 
				"        \"gln-0030\": \"바로 충전하시고 편하게 사용하세요.\",\r\n" + 
				"        \"gln-0040\": \"바로 충전하기\",\r\n" + 
				"        \"gln-0050\": \"나중에 충전하기\"\r\n" + 
				"    },\r\n" + 
				"    \"SET-05-004\": {\r\n" + 
				"        \"title\": \"은행 추가\"\r\n" + 
				"    },\r\n" + 
				"\r\n" + 
				"    \"SET-05-005\": {\r\n" + 
				"        \"title\": \"순서설정\",\r\n" + 
				"        \"p0010\": \"결제 시 순서대로 금액이 차감됩니다.\"\r\n" + 
				"    },\r\n" + 
				"    \"SET-06-001\": {\r\n" + 
				"        \"gln-title\": \"환급\",\r\n" + 
				"        \"gln-0010\": \"금액 입력\",\r\n" + 
				"        \"gln-0020\": \"금액입력\",\r\n" + 
				"        \"gln-0030\": \"환급가능 금액\",\r\n" + 
				"        \"gln-0040\": \"전액 환급하기\",\r\n" + 
				"        \"gln-0050\": \"확인\",\r\n" + 
				"        \"gln-0060\": \"최소\",\r\n" + 
				"        \"gln-0061\": \"이상 입력해 주세요.\",\r\n" + 
				"        \"gln-0070\": \"충전 가능 금액\"\r\n" + 
				"    },\r\n" + 
				"    \"SET-06-002\": {\r\n" + 
				"        \"gln-0010\": \"충전\",\r\n" + 
				"        \"gln-0011\": \"충전결과\",\r\n" + 
				"        \"gln-0020\": \"충전성공\",\r\n" + 
				"        \"gln-0030\": \"환급\",\r\n" + 
				"        \"gln-0040\": \"기준시각\",\r\n" + 
				"        \"gln-0041\": \"거래시각\",\r\n" + 
				"        \"gln-0050\": \"환급금액\",\r\n" + 
				"        \"gln-0060\": \"수수료\",\r\n" + 
				"        \"gln-0070\": \"거래 후 잔액\"\r\n" + 
				"    },\r\n" + 
				"    \"SET-06-003\": {\r\n" + 
				"        \"gln-0010\": \"환급\",\r\n" + 
				"        \"gln-0011\": \"환급결과\",\r\n" + 
				"        \"gln-0020\": \"환급실패\",\r\n" + 
				"        \"gln-0030\": \"환급을 실패했습니다.\"\r\n" + 
				"    },\r\n" + 
				"    \"SET-07-001\":{\r\n" + 
				"        \"gln-title\": \"서비스 정보 동의\",\r\n" + 
				"        \"gln-0010\": \"필수\",\r\n" + 
				"        \"gln-0011\": \"선택\",\r\n" + 
				"        \"gln-0020\": \"개정일\",\r\n" + 
				"        \"gln-0021\": \"동의 일자\",\r\n" + 
				"        \"gln-0030\": \"약관보기\",\r\n" + 
				"        \"gln-0040\": \"동의\",\r\n" + 
				"        \"gln-0050\": \"동의 안함\",\r\n" + 
				"        \"gln-0060\": \"서비스 탈회하기\",\r\n" + 
				"        \"koex001-title\":\"서비스 정보 동의\"\r\n" + 
				"    },\r\n" + 
				"    \"SET-07-002\":{\r\n" + 
				"        \"koex001-title\":\"이용약관\"\r\n" + 
				"    },\r\n" + 
				"    \"CNT-01-001\":{\r\n" + 
				"        \"gln-title\": \"GLN소개\",\r\n" + 
				"        \"gln-0010\": \"어디에 있어도\",\r\n" + 
				"        \"gln-0011\": \"당신은 특별합니다.\",\r\n" + 
				"        \"gln-0020\": \"한국, 인도네시아, 대만, 베트남 등지에서\",\r\n" + 
				"        \"gln-0021\": \"나의 디지털 머니를 사용하고\",\r\n" + 
				"        \"gln-0022\": \"로열티 혜택을 누릴 수 있습니다.\"\r\n" + 
				"    },\r\n" + 
				"    \"CNT-02-001\": {\r\n" + 
				"      \"gln-title\": \"매장결제 이용안내\",\r\n" + 
				"      \"gln-0010\": \"해외에서도 GLN을 통해\",\r\n" + 
				"      \"gln-0011\": \"쉽게 결제할 수 있어요\",\r\n" + 
				"      \"gln-0020\": \"결제 가능 매장\",\r\n" + 
				"      \"gln-0030\": \"GLN 메인 화면에서 “결제” 버튼을 터치하세요\",\r\n" + 
				"      \"gln-0031\": \"비밀번호를 입력해 바코드(QR)를 생성하세요\",\r\n" + 
				"      \"gln-0032\": \"GLN 메인 화면에서 “결제” 버튼을 터치하세요\",\r\n" + 
				"      \"gln-0033\": \"점원에게 바코드(QR)를 보여주세요\",\r\n" + 
				"      \"gln-0034\": \"점원이 바코드(QR)를 스캔하면 결제가 완료됩니다.\"\r\n" + 
				"    },\r\n" + 
				"    \"CER-01-001\":{\r\n" + 
				"      \"gln-title\": \"비밀번호 찾기\",\r\n" + 
				"      \"gln-0010\": \"GLN 아이디\",\r\n" + 
				"      \"gln-0020\": \"아이디를 확인해주세요.\",\r\n" + 
				"      \"gln-0030\": \"아이디 확인\",\r\n" + 
				"      \"gln-0040\": \"회원인증\",\r\n" + 
				"      \"gln-0050\": \"휴대폰 인증\",\r\n" + 
				"      \"gln-0051\": \"이메일 인증\",\r\n" + 
				"      \"gln-0052\": \"거래승인 비밀번호 확인\",\r\n" + 
				"      \"gln-0053\": \"보안 질문에 답변\"\r\n" + 
				"    },\r\n" + 
				"    \"CER-01-002\":{\r\n" + 
				"      \"gln-title\":\"GLN ID 찾기\",\r\n" + 
				"      \"gln-0010\":\"회원인증을 위해 정보확인이 필요합니다.\",\r\n" + 
				"      \"gln-0020\":\"휴대폰인증\",\r\n" + 
				"      \"gln-0030\":\"이메일인증\"\r\n" + 
				"    },\r\n" + 
				"    \"CER-02-001\": {\r\n" + 
				"      \"gln-title\":\"휴대폰 번호 인증\",\r\n" + 
				"      \"gln-0010\":\"휴대폰번호 인증\",\r\n" + 
				"      \"gln-0020\":\"휴대폰번호('-'없이 입력)\",\r\n" + 
				"      \"gln-0030\":\"휴대폰번호를 확인해 주세요.\",\r\n" + 
				"      \"gln-0040\":\"인증번호\",\r\n" + 
				"      \"gln-0041\":\"인증번호 받기\",\r\n" + 
				"      \"gln-0050\":\"인증번호 재발송\",\r\n" + 
				"      \"gln-0060\":\"인증번호\"\r\n" + 
				"\r\n" + 
				"    },\r\n" + 
				"    \"CER-03-001\": {\r\n" + 
				"      \"gln-title\": \"거래승인 비밀번호 인증\",\r\n" + 
				"      \"gln-0010\": \"거래승인 비밀번호를 입력하세요.\",\r\n" + 
				"      \"gln-0020\": \"거래승인 비밀번호를 확인해주세요.\",\r\n" + 
				"      \"gln-0030\": \"비밀번호를 잊으셨나요\"\r\n" + 
				"    },\r\n" + 
				"    \"CER-04-001\": {\r\n" + 
				"      \"gln-title\":\"이메일 등록\",\r\n" + 
				"      \"gln-0010\": \"이메일확인\",\r\n" + 
				"      \"gln-0020\": \"이메일 등록\",\r\n" + 
				"      \"gln-0030\": \"이메일 등록\",\r\n" + 
				"      \"gln-0040\": \"인증번호를 받을 수 있는 이메일을 입력해 주세요.\",\r\n" + 
				"      \"gln-0041\": \"확인을 위해 2번 입력해 주세요.\"\r\n" + 
				"    },\r\n" + 
				"    \"CER-04-002\": {\r\n" + 
				"      \"gln-title\": \"이메일 등록\",\r\n" + 
				"      \"gln-0010\": \"이메일 확인\",\r\n" + 
				"      \"gln-0020\": \"아래 이메일로 인증번호가 전송되었습니다.\",\r\n" + 
				"      \"gln-0030\": \"이메일 인증번호\",\r\n" + 
				"      \"gln-0040\": \"전송받은 '6자리 인증번호'를 입력해주세요.\"\r\n" + 
				"    },\r\n" + 
				"    \"BYE-01-001\": {\r\n" + 
				"      \"gln-title\": \"GLN서비스 탈퇴\",\r\n" + 
				"      \"gln-0010\": \"탈퇴를 하면 기존 혜택이 모두 사라집니다.\",\r\n" + 
				"      \"gln-0020\": \"탈퇴는 24시간 가능하며 최대 2일 이내에\",\r\n" + 
				"      \"gln-0021\": \"처리됩니다.\",\r\n" + 
				"      \"gln-0030\": \"탈퇴전 반드시 충전한 금액을 환급 받으세요.\",\r\n" + 
				"      \"gln-0040\": \"환급하기\",\r\n" + 
				"      \"gln-0050\": \"환급이 완료 되었다면 아래 버튼을 눌러\",\r\n" + 
				"      \"gln-0051\": \"탈회를 마무리 해주세요.\",\r\n" + 
				"      \"gln-0060\": \"탈회를 하면 기존 혜택이 모두 사라집니다.\",\r\n" + 
				"      \"gln-0070\": \"탈회전 반드시 충전한 금액을 환급 받으세요.\",\r\n" + 
				"      \"gln-0080\": \"환급할 금액이 없습니다.\",\r\n" + 
				"      \"gln-0090\": \"정말로 탈퇴하시겠습니까?\",\r\n" + 
				"      \"gln-0100\": \"탈회하기\",\r\n" + 
				"\r\n" + 
				"      \"koex001-0010\": \"하나머니\",\r\n" + 
				"      \"koex001-0011\": \"GLN머니\",\r\n" + 
				"      \"koex001-0020\": \"전환이 완료되었습니다.\",\r\n" + 
				"      \"koex001-0030\": \"확인\"\r\n" + 
				"    },\r\n" + 
				"    \"BYE-02-001\": {\r\n" + 
				"      \"gln-title\": \"GLN 서비스 탈퇴\",\r\n" + 
				"      \"gln-0010\": \"감사합니다\",\r\n" + 
				"      \"gln-0020\": \"서비스 탈퇴가 완료 되었습니다.\",\r\n" + 
				"      \"gln-0030\": \"GLN 서비스를 이용해주셔서 감사합니다.\",\r\n" + 
				"      \"gln-0040\": \"확인\",\r\n" + 
				"      \"koex001-title\": \"GLN 서비스 탈회\",\r\n" + 
				"      \"koex001-0010\": \"감사합니다\",\r\n" + 
				"      \"koex001-0020\": \"서비스 탈회가 완료 되었습니다.\",\r\n" + 
				"      \"koex001-0030\": \"GLN 서비스를 이용해주셔서 감사합니다.\",\r\n" + 
				"      \"koex001-0040\":\"확인\"\r\n" + 
				"    },\r\n" + 
				"    \"COM-01-001\" : {\r\n" + 
				"        \"gln-0010\": \"사용내역\",\r\n" + 
				"        \"gln-0020\": \"충전하기\",\r\n" + 
				"        \"gln-0030\": \"PAY\",\r\n" + 
				"        \"gln-0031\": \"SCAN\",\r\n" + 
				"        \"gln-0040\": \"설정\",\r\n" + 
				"        \"gln-0050\": \"이용안내\",\r\n" + 
				"        \"gln-0060\": \"GLN 소개\"\r\n" + 
				"    },\r\n" + 
				"    \"COM-01-003\": {\r\n" + 
				"        \"gln-0010\": \"자세히 보기\"\r\n" + 
				"    },\r\n" + 
				"    \"COM-02-001\": {\r\n" + 
				"      \"gln-0010\": \"이용약관 동의\",\r\n" + 
				"      \"gln-0020\": \"GLN 서비스가 추가/변경 되어\",\r\n" + 
				"      \"gln-0021\": \"관련 약관에 대한 추가 동의가 필요합니다.\",\r\n" + 
				"      \"gln-0030\": \"서비스 약관동의\",\r\n" + 
				"      \"gln-0031\": \"개인정보 제공동의(선택)\",\r\n" + 
				"      \"gln-0032\": \"GLN선택 약관 명(선택)\",\r\n" + 
				"      \"gln-0040\": \"내용보기\",\r\n" + 
				"      \"gln-0050\": \"동의함\",\r\n" + 
				"      \"gln-0051\": \"동의하지 않음\"\r\n" + 
				"    },\r\n" + 
				"    \"COM-03-002\": {\r\n" + 
				"      \"gln-0010\": \"자동 로그아웃 되었습니다.\",\r\n" + 
				"      \"gln-0020\": \"10분동안 동작이 없을 경우\",\r\n" + 
				"      \"gln-0021\": \"보안상의 이유로 자동 로그아웃 합니다.\",\r\n" + 
				"      \"gln-0030\": \"홈으로\"\r\n" + 
				"    },\r\n" + 
				"    \"COM-03-003\": {\r\n" + 
				"      \"gln-0010\": \"다른 방법으로 접근이 필요합니다.\",\r\n" + 
				"      \"gln-0020\": \"GLN서비스는 은행과 연계하여 제공됩니다.\",\r\n" + 
				"      \"gln-0021\": \"각 은행의 서비스 앱을 통해 진입하거나\",\r\n" + 
				"      \"gln-0022\": \"로그인 하여 이용하세요.\",\r\n" + 
				"      \"gln-0030\": \"홈으로\"\r\n" + 
				"    },\r\n" + 
				"    \"JON-01-001\": {\r\n" + 
				"      \"gln-title\": \"회원가입\",\r\n" + 
				"      \"gln-0010\": \"GLN회원으로 가입하시면 하나멤버스를 통하지 않고 브라우저에서 바로 서비스 이용이 가능합니다.\",\r\n" + 
				"      \"gln-0011\": \"아래 순서로 등록 하세요.\",\r\n" + 
				"      \"gln-0020\": \"아이디/비밀번호 등록\",\r\n" + 
				"      \"gln-0021\": \"기본 회원 정보 등록\",\r\n" + 
				"      \"gln-0022\": \"휴대폰 번호/이메일 등록\",\r\n" + 
				"      \"gln-0023\": \"본안확인 질문 답변 등록(선택)\",\r\n" + 
				"      \"gln-0030\": \"다음\"\r\n" + 
				"    },\r\n" + 
				"    \"JON-02-001\": {\r\n" + 
				"      \"gln-title\": \"회원가입\",\r\n" + 
				"      \"gln-0010\": \"아이디/비밀번호 등록\",\r\n" + 
				"      \"gln-0020\": \"GLN ID와 비밀번호를 설정하시면 모바일 웹 브라우저에서 직접 GLN서비스를 이용하실 수 있습니다.\",\r\n" + 
				"      \"gln-0030\": \"GLN 아이디\",\r\n" + 
				"      \"gln-0040\": \"아이디를 입력해주세요.\",\r\n" + 
				"      \"gln-0050\": \"비밀번호\",\r\n" + 
				"      \"gln-0060\": \"비밀번호 입력\",\r\n" + 
				"      \"gln-0061\": \"비밀번호 입력 확인\",\r\n" + 
				"      \"gln-0070\": \"8자리 이상 입력해주세요\",\r\n" + 
				"      \"gln-0071\": \"(영문 대문자 포함, 숫자 또는 기호 포함)\",\r\n" + 
				"      \"gln-0072\": \"확인을 위해 2번 입력해 주세요.\",\r\n" + 
				"      \"gln-0080\": \"비밀번호를 입력해주세요.\"\r\n" + 
				"    },\r\n" + 
				"    \"JON-03-001\": {\r\n" + 
				"      \"gln-title\": \"회원가입\",\r\n" + 
				"      \"gln-0010\": \"기본 회원 정보 등록\",\r\n" + 
				"      \"gln-0020\": \"이름\",\r\n" + 
				"      \"gln-0030\": \"이름을 입력해주세요.\",\r\n" + 
				"      \"gln-0040\": \"생년월일\"\r\n" + 
				"    },\r\n" + 
				"    \"JON-04-001\": {\r\n" + 
				"      \"gln-title\": \"회원가입\",\r\n" + 
				"      \"gln-0010\": \"휴대폰번호 등록\",\r\n" + 
				"      \"gln-0020\": \"휴대폰번호('-'없이 입력)\",\r\n" + 
				"      \"gln-0030\": \"휴대폰번호를 확인해주세요.\",\r\n" + 
				"      \"gln-0040\": \"인증번호 받기\",\r\n" + 
				"      \"gln-0050\": \"인증번호\",\r\n" + 
				"      \"gln-0060\": \"인증번호 재발송\",\r\n" + 
				"      \"gln-0070\": \"인증번호\",\r\n" + 
				"      \"gln-0080\": \"이메일로 가입하기\",\r\n" + 
				"      \"gln-0090\": \"인증번호를 확인해주세요.\",\r\n" + 
				"      \"gln-0100\": \"인증번호 유효시간이 초과되었습니다.\"\r\n" + 
				"    },\r\n" + 
				"    \"JON-05-001\": {\r\n" + 
				"      \"gln-title\": \"회원가입\",\r\n" + 
				"      \"gln-0010\": \"이메일 등록\",\r\n" + 
				"      \"gln-0020\": \"이메일 주소\",\r\n" + 
				"      \"gln-0030\": \"휴대폰번호로 가입하기\"\r\n" + 
				"    },\r\n" + 
				"    \"JON-06-001\":{\r\n" + 
				"        \"gln-title\": \"회원가입\",\r\n" + 
				"        \"gln-0010\": \"질문답변 등록(선택)\",\r\n" + 
				"        \"gln-0020\": \"첫 번째 질문\",\r\n" + 
				"        \"gln-0021\": \"두 번째 질문\",\r\n" + 
				"        \"gln-0022\": \"세 번째 질문\",\r\n" + 
				"        \"gln-0030\": \"질문 선택하기\",\r\n" + 
				"        \"gln-0040\": \"두 번째 질문 추가(선택)\",\r\n" + 
				"        \"gln-0041\": \"세 번째 질문 추가(선택)\",\r\n" + 
				"        \"gln-0050\": \"문자,숫자만 입력해주세요(3~30자리)\",\r\n" + 
				"        \"gln-0060\": \"건너뛰기\"\r\n" + 
				"    },\r\n" + 
				"    \"JON-06-002\": {\r\n" + 
				"        \"gln-title\": \"회원가입\",\r\n" + 
				"        \"gln-0010\": \"질문답변 등록(선택)\"\r\n" + 
				"    },\r\n" + 
				"    \"JON-07-001\": {\r\n" + 
				"        \"gln-title\": \"회원가입\",\r\n" + 
				"        \"gln-0010\": \"축하드립니다.\",\r\n" + 
				"        \"gln-0020\": \"GLN 서비스 가입이 완료되었습니다.\",\r\n" + 
				"        \"gln-0030\": \"이제 하나멤버스를 통하지 않고\",\r\n" + 
				"        \"gln-0040\": \"브라우저에서 바로 서비스 이용이 가능합니다.\",\r\n" + 
				"        \"gln-0050\": \"메인으로\",\r\n" + 
				"        \"gln-0060\": \"홈 화면에 아이콘 만들기\"\r\n" + 
				"    },\r\n" + 
				"    \"JON-08-001\": {\r\n" + 
				"        \"gln-title\": \"홈 화면 추가 안내\",\r\n" + 
				"        \"gln-0010\": \"안드로이드 크롬\",\r\n" + 
				"        \"gln-0020\": \"iOS 사파리\",\r\n" + 
				"        \"gln-0011\": \"1. ‘옵션’ 버튼 선택\",\r\n" + 
				"        \"gln-0012\": \"2. ‘홈 화면에 추가’ 선택\",\r\n" + 
				"        \"gln-0013\": \"3. ‘추가’를 눌러 홈 화면 아이콘으로 추가\",\r\n" + 
				"        \"gln-0021\": \"1. ‘옵션’ 버튼 선택\",\r\n" + 
				"        \"gln-0022\": \"2. ‘홈 화면에 추가’ 선택\",\r\n" + 
				"        \"gln-0023\": \"3. ‘추가’를 눌러 홈 화면 아이콘으로 추가\"\r\n" + 
				"    }\r\n" + 
				"}\r\n" + 
				"";
		
		
		JSONObject requestJson = JSONObject.fromObject(jsonString);
		TAData result = TADataUtil.jsonToTAData(requestJson);
		
		for(String key : result.keySet()) {
			
//			System.out.println(key);			
			TAData subResult = result.getTAData(key);
			
			
			for(String subKey : subResult.keySet()) {
				
				String lblId = key+subKey;
				String langCd = "ko";
//				StringBuilder viewMsgQuery = new StringBuilder();
//				viewMsgQuery.append("INSERT INTO VIEW_MSG (VIEW_ID, MSG_UNQNO, LBL_ID, MSG_CTT, RGR_ID, CHR_ID) VALUES (");
//				viewMsgQuery.append("'"+key+"', ");
//				viewMsgQuery.append("'"+subKey+"', ");
//				viewMsgQuery.append("'"+lblId+"', ");
//				viewMsgQuery.append("'"+subResult.getString(subKey)+"', ");
//				viewMsgQuery.append("'system', 'system');");
//				System.out.println(viewMsgQuery.toString());
				
				
				StringBuilder glnLangSysQuery = new StringBuilder();
				glnLangSysQuery.append("INSERT INTO GLN_SYS_LANG_PKG(LBL_ID, LANG_CD, TBL_NM, COM_NM, CTT, USE_YN, RGR_ID, CHR_ID) VALUES (");
				glnLangSysQuery.append("'"+lblId+"', ");
				glnLangSysQuery.append("'"+langCd+"', ");
				glnLangSysQuery.append("'VIEW_MSG', ");
				glnLangSysQuery.append("'MSG_CTT', ");
				glnLangSysQuery.append("'"+subResult.getString(subKey)+"', ");
				glnLangSysQuery.append("'Y', ");
				glnLangSysQuery.append("'system', 'system');");
				System.out.println(glnLangSysQuery.toString());
				
			}
		}
		
	}
}